{
  "sicilian": {
    "name": "Sicilian defense",
    "moves": ["e4 c5"],
    "details": "The Sicilian is one of the major answers to 1.e4. Black takes control of the d4 square with a pawn from the side - thus he imbalances the position and avoids giving White a central target.",
    "pros": [
      "Unbalances the game",
      "Gives Black good chances of attack",
      "Great opening when you need to play for a win"
    ],

    "cons": [
      "White has many ways to meet the Sicilian",
      "In the main variations, White gets great attacking chances",
      "There is a lot of theory"
    ]
  },
  "ruy_lopez": {
    "name": "Ruy López",
    "moves": ["e4 e5", "Nf2 Nc6", "Bb5"],
    "imagePath": "https://images.chesscomfiles.com/uploads/v1/images_users/tiny_mce/PedroPinhata/phpJh9t9d.png",
    "details": "The Ruy Lopez (also known as the Spanish Opening or Spanish Game) is one of the oldest and most analyzed openings in chess history. Most of the world's top players have adopted this rich opening as part of their repertoire, and many of them play it with both colors. Despite having a large amount of theory, it is an opening that players of all levels can enjoy.",
    "starting_position": "The Ruy Lopez starts after the moves 1.e5 e5 2.Nf3 Nc6 3.Bb5. White finishes the development of their kingside pieces and gets ready to castle short. The critical idea behind 3.Bb5, however, is to attack Black's c6-knight. White fights for the control of the central d4 and e5-squares and indirectly threatens the black e5-pawn by attacking its only defender. Although the Ruy Lopez is a flexible opening that can lead to tactical skirmishes, games usually develop into a long struggle for the center that spreads to an attack on the flanks. Since Black has a hard time getting an advantage in this opening, some people refer to it as the \"Spanish Torture.\"",
    "pros": [
      "It leads to very complex and multifaceted play",
      "It tends to give White long-term pressure",
      "White develops rapidly, and castles quickly",
      "There are good lines for both tactical and positional players"
    ],
    "cons": [
      "It's difficult to learn its extensive theory",
      "Black has a vast number of defenses to choose from"
    ]
  }
}
